app/services/alert_notification_service.rb

UPDATE "alerts" SET "status" = 1 WHERE "alerts"."id" IN (SELECT "alerts"."id" FROM "alerts" INNER JOIN "users" ON "users"."id" = "alerts"."user_id" INNER JOIN "coins" ON "coins"."id" = "alerts"."coin_id" WHERE "alerts"."user_id" = $1 AND "coins"."symbol" = $2)  [["user_id", 1], ["symbol", "btc"]]
---
    def update_db_entries user_alert_data
        user_alert_data.each do |data|
            alert = Alert.joins(:user, :coin).where(user_id: data[:user_ids], coins: {symbol: data[:coin_symbol]}).update_all(status: 'triggered')

SELECT "alerts"."user_id" FROM "alerts" WHERE "alerts"."id" = $1  [["id", 2]]
---
    def get_user_ids alert_ids
        Alert.where(id: alert_ids).pluck(:user_id)