app/controllers/alerts_controller.rb

INSERT INTO "alerts" ("target_price", "user_id", "coin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["target_price", 50000], ["user_id", 2], ["coin_id", 1], ["created_at", "2022-03-20 15:43:51.344478"], ["updated_at", "2022-03-20 15:43:51.344478"]]
---
    def create
        @alert = @current_user.alerts.build(alert_params)
        if @alert.save

SELECT COUNT(*) FROM "alerts" WHERE "alerts"."user_id" = $1  [["user_id", 16]]
SELECT "coins".* FROM "coins" WHERE "coins"."id" IN ($1, $2)  [["id", 4], ["id", 5]]
SELECT  "alerts".* FROM "alerts" WHERE "alerts"."user_id" = $1 AND "alerts"."status" = $2 ORDER BY created_at DESC LIMIT $3 OFFSET $4  [["user_id", 2], ["status", 0], ["LIMIT", 10], ["OFFSET", 0]]
SELECT  "alerts".* FROM "alerts" WHERE "alerts"."user_id" = $1 ORDER BY created_at DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
---
    def index
        if params["status"].present?
            if valid_filter_params?
                cache_key = prepare_cache_key
                alerts = Rails.cache.fetch(cache_key,expires_in: 2.hours) do
                    @current_user.alerts.includes(:coin).send(params["status"]).order('created_at DESC').page(@page).as_json
                end
                render json: {data: alerts, current_page: @page, success: 'true'}, status: :ok
            else
                render json: {message: "Invalid filter value. Allowed Values are # {created, triggered, cancelled}", success: 'false'}, status: :unprocessable_entity
            end
        else
            cache_key = prepare_cache_key
            alerts = Rails.cache.fetch(cache_key,expires_in: 2.hours) do
                @current_user.alerts.includes(:coin).order('created_at DESC').page(@page).as_json

DELETE FROM "alerts" WHERE "alerts"."id" = $1  [["id", 6]]
---
    def destroy
        if @alert.nil?
            render json: {success: 'false', message: 'No Alert found'}, status: :unprocessable_entity
        else
            if @alert.user_id == @current_user.id
                delete_redis_entry @alert
                @alert.destroy

SELECT MAX("alerts"."updated_at") FROM "alerts" WHERE "alerts"."user_id" = $1  [["user_id", 2]]
---
    def prepare_cache_key
        {
            user_id: @current_user.id,
            latest_alert: @current_user.alerts.maximum(:updated_at),
            page: @page,
            status: params["status"] || nil

SELECT  "alerts".* FROM "alerts" WHERE "alerts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1  [["id", 2]]
---
    def load_alert
        @alert = Alert.includes(:coin).find_by(id: params[:id])