app/controllers/application_controller.rb

    def authenticate_user!
        if user_in_token?
            user = User.find(auth_token[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]