app/controllers/coins_controller.rb

SELECT  "coins".* FROM "coins" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "coins"
---
    def index
        @coins = Coin.all ## current_user.alerts
        render json: {data: @coins.page(@page), current_page: @page, total_pages: @coins.page.total_pages, success: 'true'}, status: :ok