app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sharma.17abhinav@gmail.com"], ["LIMIT", 1]]
---
    def sign_in
        @user = User.find_by(email: sign_in_params[:email])

INSERT INTO "users" ("email", "password_digest", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save and @user.valid?