app/jobs/send_email_notification_job.rb

SELECT "users"."email" FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
    def perform(data)
      coin = data[:coin_symbol]
      emails = User.where(id: data[:user_ids]).pluck(:email)